In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# Read the file
file_location = "./sample_data/ChurnModeling.csv"
data = pd.read_csv(file_location)
# Visuailze the dataset
data.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [ ]:
# Label column is 'Exited' for this dataset
label = 'Exited'

In [ ]:
# Rearrage the dataset columns
cols = data.columns.tolist()
colIdx = data.columns.get_loc(label)
# Do nothing if the label is in the 0th position
# Otherwise, change the order of columns to move label to 0th position
if colIdx != 0:
    cols = cols[colIdx:colIdx+1] + cols[0:colIdx] + cols[colIdx+1:]
# Change the order of data so that label is in the 0th column
modified_data = data[cols]

In [ ]:
# Remove the useless columns
# Note that below code is a sample
# Please change the value as you see fit
useless_cols = ['RowNumber', 'Surname']
modified_data = modified_data.drop(useless_cols, axis=1)

In [ ]:
# One hot encode the categorical columns
from sklearn.preprocessing import OneHotEncoder
from scipy import sparse
cat_columns = ['Geography', 'Gender']
one_hot_encode_model = OneHotEncoder(handle_unknown='ignore').fit(modified_data[cat_columns])
new_features = one_hot_encode_model.transform(modified_data[cat_columns])
new_feature_names = one_hot_encode_model.get_feature_names(cat_columns)
if (sparse.issparse(new_features)):
  new_features = new_features.toarray()
dataframe = pd.DataFrame(new_features, columns=new_feature_names)
modified_data = modified_data.drop(cat_columns, axis=1)
modified_data = pd.concat([modified_data, dataframe], axis=1)

In [ ]:
# Convert the data to float
modified_data = modified_data.astype('float')
modified_data[label] = modified_data[label].astype('int')
# Write the dataset as a csv
modified_data.to_csv('./sample_data/ChurnModeling_modified.csv', index=False, header = False)